In [1]:
import sqlite3
import pandas as pd
df = pd.DataFrame({"id": [1, 2, 3, 4, 5],
    "name": ["David Beggam", "Rahul Josh",
                            "Joe Kamal", "Micheal John", "Sarath Kumar"],
                  "address": ["California", "Mumbai",
                              "Banglore", "Delhi", "Chennai"]})
df

   id          name     address
0   1  David Beggam  California
1   2    Rahul Josh      Mumbai
2   3     Joe Kamal    Banglore
3   4  Micheal John       Delhi
4   5  Sarath Kumar     Chennai

In [5]:
df.set_index('id')
##its already in order

            name     address
id
1   David Beggam  California
2     Rahul Josh      Mumbai
3      Joe Kamal    Banglore
4   Micheal John       Delhi
5   Sarath Kumar     Chennai

In [6]:
import mysql.connector as sql

In [8]:
db=sql.connect(host='localhost',user='root',passwd='rahul1432',use_pure=True)

In [9]:
print(db)

<mysql.connector.connection.MySQLConnection object at 0x000002BDC3BB16D0>

In [14]:
data=pd.read_sql_query('show tables from employees',db)

C:\Users\63094\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [15]:
data

     Tables_in_employees
0      business_analysis
1       current_dept_emp
2         department_dup
3            departments
4               dept_emp
5   dept_emp_latest_date
6           dept_manager
7       dept_manager_dup
8              employees
9               salaries
10                titles

In [24]:
db1=sql.connect(host='localhost',user='root',passwd='rahul1432',use_pure=True,database='hi')

In [25]:
c=db1.cursor()

In [26]:
c.execute("create table students(id int(4) auto_increment primary key,name varchar(255),occupation varchar(255))")

In [28]:
s='insert into students(name,occupation) value (%s,%s)'

In [29]:
v=('rahul','student')

In [30]:
c.execute(s,v)

In [31]:
db1.commit()

In [37]:
b='select * from students'

In [39]:
c.executemany()

TypeError: executemany() missing 1 required positional argument: 'seq_params'